eisup_2019_docmng_integration/src/Documents/ДоговорНаВыполнениеРаботСФизЛицом/ДоговорНаВыполнениеРаботСФизЛицом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорНаВыполнениеРаботСФизЛицом</name>
  <comment>(Регл)</comment>
  <basedOn>Catalog.СотрудникиОрганизаций</basedOn>
  <registerRecords>InformationRegister.РеглУчетПлановыхНачисленийРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаРаботу</name>
    <comment>Сумма в валюте документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровСФизЛицами</types>
      <types>EnumRef.ВидыДоговоровГПХСФизЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвторскогоДоговора</name>
    <type>
      <types>EnumRef.ВидыАвторскогоДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерОплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыПоДоговору</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтнесениеРасходовКДеятельностиЕНВД</name>
    <type>
      <types>EnumRef.ОтнесениеРасходовКДеятельностиЕНВД</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВычета</name>
    <type>
      <types>CatalogRef.ВычетыНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусДоговора</name>
    <type>
      <types>EnumRef.абс_СтатусыДоговоровПодряда</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусИСУЗК</name>
    <type>
      <types>EnumRef.абс_СтатусыКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПаспортныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресПоПрописке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресМестаЖительства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресПропискиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресПроживанияПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВНДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ГруппаСпособовОтражения</name>
    <type>
      <types>CatalogRef.ttk_ГруппыСпособовОтражения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_ГрафикРабот</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОтветственныеЛицаПодразделений/абс_ОтветственныеЛицаПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОтветственныеЛицаПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовДоговоровПодряда/абс_ИзменениеСтатусовДоговоровПодряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовДоговоровПодряда</name>
  <comment>18259</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДоговора</name>
    <type>
      <types>EnumRef.абс_СтатусыДоговоровПодряда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоровПодряда/абсСтатусыДоговоровПодряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоровПодряда</name>
  <comment>18259</comment>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРукДеп</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОтделомКадров</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаНСИ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ДоговорНаВыполнениеРаботСФизЛицом/ManagerModule.bsl
// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки)
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в которой был выведен объект)
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БланкСогласования") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "БланкСогласования", "Бланк согласования", ПечатьБланка(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПараметрыДоговора(Параметры,Договор)
	Попытка
		Параметры.Подразделение = Договор.Ответственный.абс_Сотрудник.ПодразделениеОрганизации;
		Если НЕ ЗначениеЗаполнено(Параметры.Подразделение) Тогда Возврат; КонецЕсли;
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	абс_ОтветственныеЛицаПодразделенийСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.абс_ОтветственныеЛицаПодразделений.СрезПоследних(
		|			&Дата,
		|			Ответственный
		|				И Активен
		|				И СтруктурнаяЕдиница = &Подразделение) КАК абс_ОтветственныеЛицаПодразделенийСрезПоследних
		|ГДЕ
		|	абс_ОтветственныеЛицаПодразделенийСрезПоследних.Активен");
		Запрос.УстановитьПараметр("Подразделение",Параметры.Подразделение); 
		Запрос.УстановитьПараметр("Дата",Договор.Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Параметры.Руководитель = Выборка.Сотрудник;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ЗаполнитьСекциюСогласования(Параметры,Договор,Статус)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	РеальнаяТаблица.Период КАК Период,
	|	РеальнаяТаблица.Договор,
	|	РеальнаяТаблица.СтатусДоговора,
	|	РеальнаяТаблица.Исполнитель,
	|	РеальнаяТаблица.Комментарий
	|ИЗ
	|	РегистрСведений.абс_ИзменениеСтатусовДоговоровПодряда.СрезПоследних(&ТекДата, Договор = &Договор) КАК Срез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ИзменениеСтатусовДоговоровПодряда КАК РеальнаяТаблица
	|		ПО Срез.Период = РеальнаяТаблица.Период
	|			И Срез.Договор = РеальнаяТаблица.Договор
	|			И Срез.СтатусДоговора = РеальнаяТаблица.СтатусДоговора
	|			И Срез.Исполнитель = РеальнаяТаблица.Исполнитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Договор",Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	й = 0;
	НомерСтрокиСтатус = -1;
	Пока й < ТЗ.Количество() Цикл
		Строка = ТЗ[й];
		Если Строка.СтатусДоговора = Статус Тогда
			Параметры.ДатаПоступления = Формат(Строка.Период,"ДФ=dd.MM.yyyy; ДЛФ=D");
			НомерСтрокиСтатус = й;
			прервать;
		КонецЕсли;
		й = й+1;
	КонецЦИкла;
	Если НомерСтрокиСтатус=-1 Тогда
		возврат;
	КонецЕсли;
	
	Строка = ТЗ[НомерСтрокиСтатус+1];
	Параметры.Замечания = Строка.Комментарий;
	Попытка
		Ответственный = ФормированиеПечатныхФормСервер.ФамилияИмяОтчество(СТРОКА.Исполнитель.абс_Сотрудник, ТекущаяДата());
		Параметры.Ответственный = Ответственный.Фамилия +" "+Лев(Ответственный.Имя,1)+". "+Лев(Ответственный.Отчество,1)+".";
	Исключение
		Параметры.Ответственный = СТРОКА.Исполнитель;
	КонецПопытки;
	Параметры.ДатаСогласования = Формат(Строка.Период,"ДФ=dd.MM.yyyy; ДЛФ=D");
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьБланка(МассивОбъектов, ОбъектыПечати)

	Макет = ПолучитьМакет("БланкСогласования");
	ТабДокумент = Новый ТабличныйДокумент;
	НомерСтрокиНачало = 1;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорыПодряда_БланкСогласования";
	ЭтоПервыйОбъект = Истина;
		
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыПодряда.Ссылка КАК Ссылка,
	|	ДоговорыПодряда.абс_СтатусДоговора КАК СтатусДоговора,
	|	абс_ИзменениеСтатусовДоговоровПодряда.Период КАК Период,
	|	абс_ИзменениеСтатусовДоговоровПодряда.СтатусДоговора КАК Статус,
	|	абс_ИзменениеСтатусовДоговоровПодряда.Исполнитель КАК Исполнитель,
	|	абс_ИзменениеСтатусовДоговоровПодряда.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорыПодряда
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ИзменениеСтатусовДоговоровПодряда КАК абс_ИзменениеСтатусовДоговоровПодряда
	|		ПО (абс_ИзменениеСтатусовДоговоровПодряда.Договор = ДоговорыПодряда.Ссылка)
	|ГДЕ
	|	ДоговорыПодряда.Ссылка В(&МассивОбъектов)
	|	И абс_ИзменениеСтатусовДоговоровПодряда.Договор В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Период
	|ИТОГИ ПО
	|	Ссылка");
						  
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	ВыборкаДоговор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговор.Следующий() Цикл
		
		Если НЕ ВыборкаДоговор.СтатусДоговора = Перечисления.абсСтатусыДоговоровПодряда.Регистрация
			И НЕ ВыборкаДоговор.СтатусДоговора = Перечисления.абсСтатусыДоговоровПодряда.Согласован Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Бланк согласования по договору подряда № " + ВыборкаДоговор.Ссылка.Номер + 
				" можно получить только в статусе регистрации договора или для полностью согласованных договоров.");
			Продолжить;
		КонецЕсли;
			
		Если НЕ ЭтоПервыйОбъект Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЭтоПервыйОбъект = Ложь;
		
		ДатаПоступленияНаРегистрацию = ПолучитьДатуСтатусаПодписанияИрегистрации(ВыборкаДоговор.Ссылка);
		
		Обл = Макет.ПолучитьОбласть("ДоговорШапка");
		Обл.Параметры.Заполнить(ВыборкаДоговор.Ссылка);
		
		Если ЗначениеЗаполнено(ДатаПоступленияНаРегистрацию) Тогда
			Обл.Параметры.ТекДата = ДатаПоступленияНаРегистрацию;
		Иначе
			Обл.Параметры.ТекДата = ТекущаяДата();
		КонецЕсли;
		
		Обл.Параметры.ТекДата = Формат(Обл.Параметры.ТекДата,"ДФ=dd.MM.yyyy; ДЛФ=D");
		Обл.Параметры.Дата = Формат(Обл.Параметры.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D");
		ТабДокумент.Вывести(Обл);
		
		Обл = Макет.ПолучитьОбласть("Договор");
		Обл.Параметры.Заполнить(ВыборкаДоговор.Ссылка);
		ЗаполнитьПараметрыДоговора(Обл.Параметры, ВыборкаДоговор.Ссылка);
		ТабДокумент.Вывести(Обл);		
		
		Обл = Макет.ПолучитьОбласть("ОбластьШапкаСогласования");
		ТабДокумент.Вывести(Обл);
		
		ОблСтрока = Макет.ПолучитьОбласть("ОбластСтрокаСогласования");
		
		ВыборкаСтатусы = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтатусы.Следующий() Цикл
			
			ОблСтрока.Параметры.Заполнить(ВыборкаСтатусы);
			
			ТабДокумент.Вывести(ОблСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОбластьПодвал"));
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДоговор.Ссылка);

	ТабДокумент.ПолеСверху = 20;
	ТабДокумент.ПолеСлева = 20;
	ТабДокумент.ПолеСлева = 5;
	ТабДокумент.ПолеСнизу = 5;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу = 0;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьДатуСтатусаПодписанияИрегистрации(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	абс_ИзменениеСтатусовДоговоровПодрядаСрезПоследних.Договор,
	|	абс_ИзменениеСтатусовДоговоровПодрядаСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.абс_ИзменениеСтатусовДоговоровПодряда.СрезПоследних(
	|			,
	|			Договор = &Договор
	|				И СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоровПодряда.Регистрация)) КАК абс_ИзменениеСтатусовДоговоровПодрядаСрезПоследних");
	
	Запрос.УстановитьПараметр("Договор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Период;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
